Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_bscif.h
/* -------- BSCIF_IMR : (BSCIF Offset: 0x008) (R/  32) Interrupt Mask Register -------- */
#define BSCIF_IMR_OFFSET            0x008        /**< \brief (BSCIF_IMR offset) Interrupt Mask Register */
#define BSCIF_IMR_RESETVALUE        0x00000000   /**< \brief (BSCIF_IMR reset_value) Interrupt Mask Register */

#define BSCIF_IMR_OSC32RDY_Pos      0            /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_OSC32RDY          (0x1u << BSCIF_IMR_OSC32RDY_Pos)
#define BSCIF_IMR_RC32KRDY_Pos      1            /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KRDY          (0x1u << BSCIF_IMR_RC32KRDY_Pos)
#define BSCIF_IMR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KLOCK         (0x1u << BSCIF_IMR_RC32KLOCK_Pos)
#define BSCIF_IMR_RC32KREFE_Pos     3            /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KREFE         (0x1u << BSCIF_IMR_RC32KREFE_Pos)
#define BSCIF_IMR_RC32KSAT_Pos      4            /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KSAT          (0x1u << BSCIF_IMR_RC32KSAT_Pos)
#define BSCIF_IMR_BOD33DET_Pos      5            /**< \brief (BSCIF_IMR) BOD33 Detected */
#define BSCIF_IMR_BOD33DET          (0x1u << BSCIF_IMR_BOD33DET_Pos)
#define BSCIF_IMR_BOD18DET_Pos      6            /**< \brief (BSCIF_IMR) BOD18 Detected */
#define BSCIF_IMR_BOD18DET          (0x1u << BSCIF_IMR_BOD18DET_Pos)
#define BSCIF_IMR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_IMR) BOD33 Synchronization Ready */
#define BSCIF_IMR_BOD33SYNRDY       (0x1u << BSCIF_IMR_BOD33SYNRDY_Pos)
#define BSCIF_IMR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_IMR) BOD18 Synchronization Ready */
#define BSCIF_IMR_BOD18SYNRDY       (0x1u << BSCIF_IMR_BOD18SYNRDY_Pos)
#define BSCIF_IMR_SSWRDY_Pos        9            /**< \brief (BSCIF_IMR) VREG Stop Switching Ready */
#define BSCIF_IMR_SSWRDY            (0x1u << BSCIF_IMR_SSWRDY_Pos)
#define BSCIF_IMR_VREGOK_Pos        10           /**< \brief (BSCIF_IMR) Main VREG OK */
#define BSCIF_IMR_VREGOK            (0x1u << BSCIF_IMR_VREGOK_Pos)
#define BSCIF_IMR_LPBGRDY_Pos       12           /**< \brief (BSCIF_IMR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IMR_LPBGRDY           (0x1u << BSCIF_IMR_LPBGRDY_Pos)
#define BSCIF_IMR_AE_Pos            31           /**< \brief (BSCIF_IMR) Access Error */
#define BSCIF_IMR_AE                (0x1u << BSCIF_IMR_AE_Pos)
#define BSCIF_IMR_MASK              0x800017FFu  /**< \brief (BSCIF_IMR) MASK Register */

/* -------- BSCIF_ISR : (BSCIF Offset: 0x00C) (R/  32) Interrupt Status Register -------- */
#define BSCIF_ISR_OFFSET            0x00C        /**< \brief (BSCIF_ISR offset) Interrupt Status Register */
#define BSCIF_ISR_RESETVALUE        0x00000000   /**< \brief (BSCIF_ISR reset_value) Interrupt Status Register */

#define BSCIF_ISR_OSC32RDY_Pos      0            /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_OSC32RDY          (0x1u << BSCIF_ISR_OSC32RDY_Pos)
#define BSCIF_ISR_RC32KRDY_Pos      1            /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KRDY          (0x1u << BSCIF_ISR_RC32KRDY_Pos)
#define BSCIF_ISR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KLOCK         (0x1u << BSCIF_ISR_RC32KLOCK_Pos)
#define BSCIF_ISR_RC32KREFE_Pos     3            /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KREFE         (0x1u << BSCIF_ISR_RC32KREFE_Pos)
#define BSCIF_ISR_RC32KSAT_Pos      4            /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KSAT          (0x1u << BSCIF_ISR_RC32KSAT_Pos)
#define BSCIF_ISR_BOD33DET_Pos      5            /**< \brief (BSCIF_ISR) BOD33 Detected */
#define BSCIF_ISR_BOD33DET          (0x1u << BSCIF_ISR_BOD33DET_Pos)
#define BSCIF_ISR_BOD18DET_Pos      6            /**< \brief (BSCIF_ISR) BOD18 Detected */
#define BSCIF_ISR_BOD18DET          (0x1u << BSCIF_ISR_BOD18DET_Pos)
#define BSCIF_ISR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_ISR) BOD33 Synchronization Ready */
#define BSCIF_ISR_BOD33SYNRDY       (0x1u << BSCIF_ISR_BOD33SYNRDY_Pos)
#define BSCIF_ISR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_ISR) BOD18 Synchronization Ready */
#define BSCIF_ISR_BOD18SYNRDY       (0x1u << BSCIF_ISR_BOD18SYNRDY_Pos)
#define BSCIF_ISR_SSWRDY_Pos        9            /**< \brief (BSCIF_ISR) VREG Stop Switching Ready */
#define BSCIF_ISR_SSWRDY            (0x1u << BSCIF_ISR_SSWRDY_Pos)
#define BSCIF_ISR_VREGOK_Pos        10           /**< \brief (BSCIF_ISR) Main VREG OK */
#define BSCIF_ISR_VREGOK            (0x1u << BSCIF_ISR_VREGOK_Pos)
#define BSCIF_ISR_LPBGRDY_Pos       12           /**< \brief (BSCIF_ISR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_ISR_LPBGRDY           (0x1u << BSCIF_ISR_LPBGRDY_Pos)
#define BSCIF_ISR_AE_Pos            31           /**< \brief (BSCIF_ISR) Access Error */
#define BSCIF_ISR_AE                (0x1u << BSCIF_ISR_AE_Pos)
#define BSCIF_ISR_MASK              0x800017FFu  /**< \brief (BSCIF_ISR) MASK Register */

/* -------- BSCIF_ICR : (BSCIF Offset: 0x010) ( /W 32) Interrupt Clear Register -------- */
#define BSCIF_ICR_OFFSET            0x010        /**< \brief (BSCIF_ICR offset) Interrupt Clear Register */
#define BSCIF_ICR_RESETVALUE        0x00000000   /**< \brief (BSCIF_ICR reset_value) Interrupt Clear Register */

#define BSCIF_ICR_OSC32RDY_Pos      0            /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_OSC32RDY          (0x1u << BSCIF_ICR_OSC32RDY_Pos)
#define BSCIF_ICR_RC32KRDY_Pos      1            /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KRDY          (0x1u << BSCIF_ICR_RC32KRDY_Pos)
#define BSCIF_ICR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KLOCK         (0x1u << BSCIF_ICR_RC32KLOCK_Pos)
#define BSCIF_ICR_RC32KREFE_Pos     3            /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KREFE         (0x1u << BSCIF_ICR_RC32KREFE_Pos)
#define BSCIF_ICR_RC32KSAT_Pos      4            /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KSAT          (0x1u << BSCIF_ICR_RC32KSAT_Pos)
#define BSCIF_ICR_BOD33DET_Pos      5            /**< \brief (BSCIF_ICR) BOD33 Detected */
#define BSCIF_ICR_BOD33DET          (0x1u << BSCIF_ICR_BOD33DET_Pos)
#define BSCIF_ICR_BOD18DET_Pos      6            /**< \brief (BSCIF_ICR) BOD18 Detected */
#define BSCIF_ICR_BOD18DET          (0x1u << BSCIF_ICR_BOD18DET_Pos)
#define BSCIF_ICR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_ICR) BOD33 Synchronization Ready */
#define BSCIF_ICR_BOD33SYNRDY       (0x1u << BSCIF_ICR_BOD33SYNRDY_Pos)
#define BSCIF_ICR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_ICR) BOD18 Synchronization Ready */
#define BSCIF_ICR_BOD18SYNRDY       (0x1u << BSCIF_ICR_BOD18SYNRDY_Pos)
#define BSCIF_ICR_SSWRDY_Pos        9            /**< \brief (BSCIF_ICR) VREG Stop Switching Ready */
#define BSCIF_ICR_SSWRDY            (0x1u << BSCIF_ICR_SSWRDY_Pos)
#define BSCIF_ICR_VREGOK_Pos        10           /**< \brief (BSCIF_ICR) Main VREG OK */
#define BSCIF_ICR_VREGOK            (0x1u << BSCIF_ICR_VREGOK_Pos)
#define BSCIF_ICR_LPBGRDY_Pos       12           /**< \brief (BSCIF_ICR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_ICR_LPBGRDY           (0x1u << BSCIF_ICR_LPBGRDY_Pos)
#define BSCIF_ICR_AE_Pos            31           /**< \brief (BSCIF_ICR) Access Error */
#define BSCIF_ICR_AE                (0x1u << BSCIF_ICR_AE_Pos)
#define BSCIF_ICR_MASK              0x800017FFu  /**< \brief (BSCIF_ICR) MASK Register */

/* -------- BSCIF_PCLKSR : (BSCIF Offset: 0x014) (R/  32) Power and Clocks Status Register -------- */
#define BSCIF_PCLKSR_OFFSET         0x014        /**< \brief (BSCIF_PCLKSR offset) Power and Clocks Status Register */
#define BSCIF_PCLKSR_RESETVALUE     0x00000000   /**< \brief (BSCIF_PCLKSR reset_value) Power and Clocks Status Register */

#define BSCIF_PCLKSR_OSC32RDY_Pos   0            /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_OSC32RDY       (0x1u << BSCIF_PCLKSR_OSC32RDY_Pos)
#define BSCIF_PCLKSR_RC32KRDY_Pos   1            /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KRDY       (0x1u << BSCIF_PCLKSR_RC32KRDY_Pos)
#define BSCIF_PCLKSR_RC32KLOCK_Pos  2            /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KLOCK      (0x1u << BSCIF_PCLKSR_RC32KLOCK_Pos)
#define BSCIF_PCLKSR_RC32KREFE_Pos  3            /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KREFE      (0x1u << BSCIF_PCLKSR_RC32KREFE_Pos)
#define BSCIF_PCLKSR_RC32KSAT_Pos   4            /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KSAT       (0x1u << BSCIF_PCLKSR_RC32KSAT_Pos)
#define BSCIF_PCLKSR_BOD33DET_Pos   5            /**< \brief (BSCIF_PCLKSR) BOD33 Detected */
#define BSCIF_PCLKSR_BOD33DET       (0x1u << BSCIF_PCLKSR_BOD33DET_Pos)
#define BSCIF_PCLKSR_BOD18DET_Pos   6            /**< \brief (BSCIF_PCLKSR) BOD18 Detected */
#define BSCIF_PCLKSR_BOD18DET       (0x1u << BSCIF_PCLKSR_BOD18DET_Pos)
#define BSCIF_PCLKSR_BOD33SYNRDY_Pos 7            /**< \brief (BSCIF_PCLKSR) BOD33 Synchronization Ready */
#define BSCIF_PCLKSR_BOD33SYNRDY    (0x1u << BSCIF_PCLKSR_BOD33SYNRDY_Pos)
#define BSCIF_PCLKSR_BOD18SYNRDY_Pos 8            /**< \brief (BSCIF_PCLKSR) BOD18 Synchronization Ready */
#define BSCIF_PCLKSR_BOD18SYNRDY    (0x1u << BSCIF_PCLKSR_BOD18SYNRDY_Pos)
#define BSCIF_PCLKSR_SSWRDY_Pos     9            /**< \brief (BSCIF_PCLKSR) VREG Stop Switching Ready */
#define BSCIF_PCLKSR_SSWRDY         (0x1u << BSCIF_PCLKSR_SSWRDY_Pos)
#define BSCIF_PCLKSR_VREGOK_Pos     10           /**< \brief (BSCIF_PCLKSR) Main VREG OK */
#define BSCIF_PCLKSR_VREGOK         (0x1u << BSCIF_PCLKSR_VREGOK_Pos)
#define BSCIF_PCLKSR_RC1MRDY_Pos    11           /**< \brief (BSCIF_PCLKSR) RC 1MHz Oscillator Ready */
#define BSCIF_PCLKSR_RC1MRDY        (0x1u << BSCIF_PCLKSR_RC1MRDY_Pos)
#define BSCIF_PCLKSR_LPBGRDY_Pos    12           /**< \brief (BSCIF_PCLKSR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_PCLKSR_LPBGRDY        (0x1u << BSCIF_PCLKSR_LPBGRDY_Pos)
#define BSCIF_PCLKSR_MASK           0x00001FFFu  /**< \brief (BSCIF_PCLKSR) MASK Register */

/* -------- BSCIF_UNLOCK : (BSCIF Offset: 0x018) ( /W 32) Unlock Register -------- */
#define BSCIF_UNLOCK_OFFSET         0x018        /**< \brief (BSCIF_UNLOCK offset) Unlock Register */
#define BSCIF_UNLOCK_RESETVALUE     0x00000000   /**< \brief (BSCIF_UNLOCK reset_value) Unlock Register */

